app/controllers/dashboard/cards_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."user_id" = $1 ORDER BY review_date  [["user_id", 1]]
---
  def index
    @cards = current_user.cards.all.order('review_date')

INSERT INTO "cards" ("original_text", "translated_text", "review_date", "created_at", "updated_at", "user_id", "block_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @card = current_user.cards.build(card_params)
    if @card.save