app/views/dashboard/cards/_form.html.erb

  <div class="form-group">
    <%= f.input :block_id, collection: current_user.blocks.all.order('title'),
                      prompt: 'Выберите колоду', label: 'Колоды',
                      input_html: { class: 'form-control', required: true } %>
---
SELECT "blocks".* FROM "blocks" WHERE "blocks"."user_id" = $1 ORDER BY title  [["user_id", 1]]