app/controllers/home/users_controller.rb

INSERT INTO "users" ("email", "crypted_password", "created_at", "updated_at", "salt", "locale") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save